2023-01/smartsim/mesh-motion/spinningBlock_hex/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "spinningBlockd.fms";

minCellSize 0.5;
maxCellSize 2;

boundaryCellSize 0.5;

/*
boundaryLayers
{
    nLayers 0;
    thicknessRatio 1.1;
    maxFirstLayerThickness 0.5;
    patchBoundaryLayers
    {
        "BLOCK.*"
        {
            nLayers           3;

            thicknessRatio    1.2;

            maxFirstLayerThickness 0.2;

            allowDiscontinuity 0;
        }
    }

    optimiseLayer 1;
    optimisationParameters
    {
        nSmoothNormals      5;
        relThicknessTol     0.15;
        featureSizeFactor   0.3;
        reCalculateNormals  1;
        maxNumIterations    5;
    }
}


localRefinement
{
    BLOCK
    {
        cellSize  0.1;
        //additionalRefinementLevels 5;
    }

}



surfaceMeshRefinement
{
    BLOCK
    {
        additionalRefinementLevels  3;
        surfaceFile "Blockd.stl";
        //refinementThickness 0.1;
    }
}
*/


/* 
objectRefinements
{
    BLOCK
    {
        type        box;
        cellSize    0.25;
        centre      (0.5 0 1.5);
        lengthX     1;
        lengthY     2;
        lengthZ     3;
    }
    
    line1
    {
        type        line;
        cellSize    0.2;
        p0          (0 -1 0);
        p1          (0 1 0);
    }
 }

meshQualitySettings
{
    maxNonOrthogonality 50;

    minTetQuality       1e-9;
}
*/ 

// ************************************************************************* //
